mySchedule = [
    {
        'devName': '103-046',  # 设备名字  座位或研讨室名字
        'weekday': '1111111',  # 每个位置代表星期数中的 一二三四五六日  1 代表这个星期数预约 0则不预约
        'friendFlag': 0,  # 预约此设备时,需不需要带上朋友(比如研讨室)  1--需要 0--不需要(默认)
        'myWaitTime': [6, 15, 1],  # 只在reserve.py生效,写明脚本启动后,预约该设备时等待到某个时刻再执行 [6,15,1]==6:15:013
        # 预约的时间段(可多个时间段)(注意:每个时间段时长在一小时和四小时之间)
        'timeSpan': [
            ['9:00:00', '13:00:00'],
            ['13:30:00', '17:30:00'],
            ['18:00:00', '21:00:00'],
        ]
    },
    {
        'devName': '研讨间E09',
        'weekday': '1111111',
        'friendFlag': 1,
        'myWaitTime': [6, 30, 1],
        'timeSpan': [
            ['8:30:00', '10:00:00']
        ]
    },
    {
        'devName': '101-046',
        'weekday': '1111111',
        'friendFlag': 0,
        'myWaitTime': [6, 16, 1],
        'timeSpan': [
            ['8:30:00', '10:00:00']
        ]
    },
]
